# CannotCreateElementInView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateElementInView Property
BuiltInFailures..::..CreationFailures Class See Also
---
Can't create this kind of element in this view in the current mode.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateElementInView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateElementInView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateElementInView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace